04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/TJunctionFan/0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentKineticEnergy;
        intensity       0.05;
        value           uniform 0.375;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
    }
    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
