04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/TJunctionFan/Allrun-NCC
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

# Create faceZones for baffles and fan
runApplication createZones

# Create baffles and the fields on them
runApplication createBaffles -dict system/createBafflesDict.NCC

# Create non-conformal couplings
runApplication createNonConformalCouples

runApplication foamRun

#------------------------------------------------------------------------------
